SamFisher940425/NeoPixelBus_GD32_DMA/systick/systick.c
/*!
    \file    systick.c
    \brief   the systick configuration file

    \version 2017-02-10, V1.0.0, firmware for GD32F30x
    \version 2018-10-10, V1.1.0, firmware for GD32F30x
    \version 2018-12-25, V2.0.0, firmware for GD32F30x
    \version 2020-09-30, V2.1.0, firmware for GD32F30x
*/

/*
    Copyright (c) 2020, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32f30x.h"
#include "systick.h"

#ifdef SYSTICK_PRECISION_US
volatile static uint64_t g_systick_us = 0;
#else
volatile static uint64_t g_systick_ms = 0;
#endif

/*!
    \brief      configure systick
    \param[in]  none
    \param[out] none
    \retval     none
*/
void Systick_Config(void)
{
#ifdef SYSTICK_PRECISION_US
    /* setup systick timer for 1000000Hz interrupts */
    if (SysTick_Config(SystemCoreClock / 1000000U))
#else
    /* setup systick timer for 1000Hz interrupts */
    if (SysTick_Config(SystemCoreClock / 1000U))
#endif
    {
        /* capture error */
        while (1)
        {
        }
    }
    /* configure the systick handler priority */
    NVIC_SetPriority(SysTick_IRQn, 0x00U);
}

/*!
    \brief      delay a time in milliseconds
    \param[in]  count: count in milliseconds
    \param[out] none
    \retval     none
*/
void Delay_ms(uint32_t count)
{
    uint64_t dest = 0;
    
#ifdef SYSTICK_PRECISION_US
    dest = count * 1000 + g_systick_us;
    while (g_systick_us <= dest)
#else
    dest = count + g_systick_ms;
    while (g_systick_ms <= dest)
#endif
    {
    }
}

/*!
    \brief      get ms timestamp
    \param[in]  none
    \param[out] none
    \retval     ms timestamp
*/
uint64_t Get_Time_ms(void)
{
#ifdef SYSTICK_PRECISION_US
    return g_systick_us * 0.001;
#else
    return g_systick_ms;
#endif
}

#ifdef SYSTICK_PRECISION_US
/*!
    \brief      delay a time in microseconds
    \param[in]  count: count in microseconds
    \param[out] none
    \retval     none
*/
void Delay_us(uint32_t count)
{
    uint64_t dest = 0;

    dest = count + g_systick_us;
    while (g_systick_us <= dest)
    {
    }
}

/*!
    \brief      get us timestamp
    \param[in]  none
    \param[out] none
    \retval     us timestamp
*/
uint64_t Get_Time_us(void)
{
    return g_systick_us;
}
#endif

/*!
    \brief      accumulate time base value
    \param[in]  none
    \param[out] none
    \retval     none
*/
void Time_Accumulation(void)
{
#ifdef SYSTICK_PRECISION_US
    g_systick_us++;
#else
    g_systick_ms++;
#endif
}
